

// с. (чуть сложнее)
//  В качестве результата функции transaer, в случае успешной 
// операции, должен cформироваться объект: 
// - account1 (счет списания), 
// - account2 (счет зачисления),
// - amount (сумма)
// - transactionInfo() (функция, которая выводит информацию о транзакции)  

// Если транзакция прошла неуспешно, объект должен содержать 
// еще и поле error c информацией об ошибке. Естественно,
// transactionInfo() должна в этом случае выводить информацию 
// о неуспешной транзакции. В случае, если транзакция успешна, 
// поля error не должно быть.

//================================>   c   <====================

